{"situation": "Task: Can you pass me a popular alternative to Coke? In front of you are Pepsi, bottled water, Coke."}
{"situation": "Task: Bring me a bag of chips. In front of you are multigrain chips, kettle chips, jalapeno chips."}
{"situation": "Task: It is too sweet. Can you dispose of it? In front of you are Sprite, bottled water, orange soda."}
{"situation": "Task: May I have the bottled unsweetened tea? In front of you are bottled unsweetened tea, apple, jalapeno chips."}
{"situation": "Task: Bring me that drink. In front of you are Pepsi, Coke, orange soda."}
{"situation": "Task: I'm craving something with a little heat. In front of you are jalapeno chips, rice chips, energy bar."}
{"situation": "Task: I drank it already. Can you dispose of it? In front of you are rice chips, apple, Pepsi."}
{"situation": "Task: Bring me that caffeinated drink. In front of you are RedBull, bottled unsweetened tea, Pepsi."}
{"situation": "Task: Knock a Coke over. In front of you are Coke, RedBull, Sprite."}
{"situation": "Task: Knock a bottled water over. In front of you are bottled water, orange soda, RedBull."}
{"situation": "Task: Bring me something to keep me going during a long drive. In front of you are RedBull, bottled tea, Pepsi."}
{"situation": "Task: Put multigrain chips beside the can. In front of you are multigrain chips, Pepsi, Sprite."}
{"situation": "Task: Put orange soda near the fruit. In front of you are apple, orange soda, orange."}
{"situation": "Task: Can you dispose of the bottle drink? It should have expired. In front of you are bottled unsweetened tea, bottled water, energy bar."}
{"situation": "Task: Put Coke in the drawer. In front of you are bottled unsweetened tea, Coke, bottled water."}
{"situation": "Task: Could you pass me a lime-flavored soda? In front of you are orange soda, bottled unsweetened tea, Sprite."}
{"situation": "Task: Can I have a bag of kettle chips?. In front of you are kettle chips, bottled tea, jalapeno chips."}
{"situation": "Task: Put the chips in the drawer. In front of you are rice chips, multigrain chips, jalapeno chips."}
{"situation": "Task: Bring me a Sprite, please. In front of you are Sprite, apple, rice chips."}
{"situation": "Task: Bring me an apple, please. In front of you are apple, rice chips, kettle chips."}
{"situation": "Task: I'm looking for a refreshing, flavored water. In front of you are bottled tea, Pepsi, RedBull."}
{"situation": "Task: Bring me that chips. In front of you are rice chips, multigrain chips, jalapeno chips."}
{"situation": "Task: It has expired. Can you dispose of it? In front of you are bottled unsweetened tea, Sprite, energy bar."}
{"situation": "Task: I'd like a drink that doesn't come in a can. In front of you are bottled water, bottled tea, Pepsi."}
{"situation": "Task: It is too spicy. Can you dispose of it? In front of you are apple, jalapeno chips, bottled unsweetened tea."}
{"situation": "Task: Can you throw away a RedBull?. In front of you are RedBull, kettle chips, rice chips."}
{"situation": "Task: Bring me that sweet drink. In front of you are Coke, Pepsi, Sprite."}
{"situation": "Task: Put away the empty can, please. In front of you are orange soda, Coke, Pepsi."}
{"situation": "Task: Can I have a bottled tea?. In front of you are bottled tea, Coke, jalapeno chips."}
{"situation": "Task: I ate it already. Can you dispose of it? In front of you are kettle chips, jalapeno chips, rice chips."}
{"situation": "Task: Put bottled water next to the fruit. In front of you are orange, apple, bottled water."}
{"situation": "Task: Bring me a snack. In front of you are apple, jalapeno chips, orange."}
{"situation": "Task: I need an orange soda. In front of you are orange soda, RedBull, Pepsi."}
{"situation": "Task: Put orange soda near the bottle. In front of you are bottled unsweetened tea, bottled water, orange soda."}
{"situation": "Task: Put the kettle chips in the middle drawer. In front of you are kettle chips, multigrain chips, Pepsi."}
{"situation": "Task: It needs to be cleaned. Can you give it to me? In front of you are dirty sponge with food residue, multigrain chips, apple."}
{"situation": "Task: Bring me that fruit. In front of you are apple, orange, energy bar."}
{"situation": "Task: I need a pick-me-up. In front of you are RedBull, Pepsi, bottled unsweetened tea."}
{"situation": "Task: Put the energy bar in the top drawer. In front of you are energy bar, jalapeno chips, kettle chips."}
{"situation": "Task: Put jalapeno chips in the drawer. In front of you are energy bar, jalapeno chips, Pepsi."}
{"situation": "Task: Put the Coke next to the orange. In front of you are bottled water, Coke, orange."}
{"situation": "Task: Put kettle chips beside the bottle. In front of you are bottled unsweetened tea, bottled water, kettle chips."}
{"situation": "Task: I'm craving a fizzy drink that's not a cola. In front of you are orange soda, Sprite, Coke."}
{"situation": "Task: Please pass me a drink without flavor. In front of you are bottled water, Coke, Pepsi."}
{"situation": "Task: Put kettle chips next to the bottle. In front of you are bottled unsweetened tea, kettle chips, bottled water."}
{"situation": "Task: Put the bottled water next to the apple. In front of you are apple, bottled water, RedBull."}
{"situation": "Task: Put RedBull beside the chips. In front of you are RedBull, rice chips, kettle chips."}
{"situation": "Task: Put Pepsi next to the fruit. In front of you are orange, apple, Pepsi."}
{"situation": "Task: Put multigrain chips next to the fruit. In front of you are orange, apple, multigrain chips."}
{"situation": "Task: Dispose of that empty chip bag, please. In front of you are jalapeno chips, multigrain chips, rice chips."}
{"situation": "Task: Bring me the sponge. In front of you are energy bar, dirty sponge with food residue, clean sponge."}
{"situation": "Task: Could you give me an energy drink?. In front of you are RedBull, bottled tea, Sprite."}
{"situation": "Task: Can you dispose of the chips? It should have expired. In front of you are kettle chips, jalapeno chips, multigrain chips."}
{"situation": "Task: I don't want to use it for cleaning any more. Can you please dispose of it? In front of you are dirty sponge with food residue, energy bar, rice chips."}
{"situation": "Task: Put the apple next to the Coke. In front of you are Coke, apple, multigrain chips."}
{"situation": "Task: Bring me something to munch on that isn't too heavy. In front of you are energy bar, rice chips, apple."}
{"situation": "Task: Put Coke near the fruit. In front of you are Coke, orange, apple."}
{"situation": "Task: Put bottled unsweetened tea beside the can. In front of you are Coke, orange soda, bottled unsweetened tea."}
{"situation": "Task: Put the apple in the middle drawer. In front of you are apple, Pepsi, energy bar."}
{"situation": "Task: Put the Sprite in the top drawer. In front of you are RedBull, rice chips, Sprite."}
{"situation": "Task: Can you throw away an energy bar?. In front of you are energy bar, Coke, kettle chips."}
{"situation": "Task: Put jalapeno chips near the bottle. In front of you are bottled water, jalapeno chips, bottled unsweetened tea."}
{"situation": "Task: I need a quick energy boost; do you have a bar for that?. In front of you are energy bar, jalapeno chips, rice chips."}
{"situation": "Task: I'd like to have a soft fruit. In front of you are energy bar, rice chips, orange."}
{"situation": "Task: Put the multigrain chips next to the orange. In front of you are RedBull, orange, multigrain chips."}
{"situation": "Task: I need a bag of multigrain chips. In front of you are multigrain chips, apple, energy bar."}
{"situation": "Task: Bring me a cola. In front of you are Coke, Pepsi, bottled water."}
{"situation": "Task: Bring me a RedBull, please. In front of you are RedBull, rice chips, Pepsi."}
{"situation": "Task: Bring me something to eat. In front of you are energy bar, jalapeno chips, orange."}
{"situation": "Task: Bring me that snack. In front of you are apple, energy bar, orange."}
{"situation": "Task: Put the bottled unsweetened tea next to the apple. In front of you are bottled unsweetened tea, RedBull, apple."}
{"situation": "Task: Put multigrain chips in the drawer. In front of you are bottled water, RedBull, multigrain chips."}
{"situation": "Task: Put jalapeno chips next to the can. In front of you are jalapeno chips, Sprite, Coke."}
{"situation": "Task: I'd like a RedBull. In front of you are RedBull, Coke, orange soda."}
{"situation": "Task: Put jalapeno chips beside the fruit. In front of you are jalapeno chips, apple, orange."}
{"situation": "Task: I need that multigrain chips. In front of you are multigrain chips, orange soda, bottled unsweetened tea."}
{"situation": "Task: Put the bottled unsweetened tea next to the orange. In front of you are bottled unsweetened tea, orange, kettle chips."}
{"situation": "Task: Dispose of the empty bottle, please. In front of you are bottled unsweetened tea, bottled water, multigrain chips."}
{"situation": "Task: Put Pepsi in the drawer. In front of you are Pepsi, bottled tea, apple."}
{"situation": "Task: Bring me that soda. In front of you are Coke, Sprite, orange soda."}
{"situation": "Task: Bring me a bag of multigrain chips, please. In front of you are multigrain chips, jalapeno chips, orange."}
{"situation": "Task: Bring me a healthy snack. In front of you are apple, orange, kettle chips."}
{"situation": "Task: Can you dispose of that soda? It should have expired. In front of you are Pepsi, Sprite, Coke."}
{"situation": "Task: Put Pepsi beside the chips. In front of you are Pepsi, rice chips, jalapeno chips."}
{"situation": "Task: Put the bottled tea next to the apple. In front of you are apple, bottled tea, RedBull."}
{"situation": "Task: Put bottled tea beside the chips. In front of you are bottled tea, rice chips, kettle chips."}
{"situation": "Task: Put orange soda near the chips. In front of you are orange soda, rice chips, multigrain chips."}
{"situation": "Task: Put multigrain chips near the can. In front of you are Coke, orange soda, multigrain chips."}
{"situation": "Task: Put bottled tea in the drawer. In front of you are bottled tea, kettle chips, Sprite."}
{"situation": "Task: I need a bottled tea. In front of you are bottled tea, Sprite, Coke."}
{"situation": "Task: Bring me a fruit. In front of you are apple, orange, multigrain chips."}
{"situation": "Task: Put RedBull next to the chips. In front of you are RedBull, multigrain chips, kettle chips."}
{"situation": "Task: Hand me a sponge please. In front of you are dirty sponge with food residue, clean sponge, kettle chips."}
{"situation": "Task: Put the jalapeno chips in the top drawer. In front of you are jalapeno chips, Coke, rice chips."}
{"situation": "Task: Bring me something to drink. In front of you are RedBull, Coke, bottled unsweetened tea."}
{"situation": "Task: Bring me a soda. In front of you are orange soda, Sprite, RedBull."}
{"situation": "Task: Can you pass me a snack that has a mix of different grains?. In front of you are multigrain chips, rice chips, energy bar."}
{"situation": "Task: Can you dispose of the jalapeno chips? In front of you are orange, bottled water, jalapeno chips."}
{"situation": "Task: Can you give me something I could use to clean up a spill?. In front of you are clean sponge, dirty sponge with food residue, RedBull."}
{"situation": "Task: Put the soda in the drawer. In front of you are jalapeno chips, Sprite, orange soda."}
